TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib/pin_map.h
#define GPIO_15_GPIO15                  0x00061E00U
#define GPIO_15_EPWM8B                  0x00061E01U
#define GPIO_15_SCIB_RX                 0x00061E02U
#define GPIO_15_MFSXB                   0x00061E03U
#define GPIO_15_OUTPUTXBAR4             0x00061E06U
#define GPIO_15_ESC_GPO7                0x00061E0AU
#define GPIO_15_FSIRXD_D0               0x00061E0DU

#define GPIO_16_GPIO16                  0x00080000U
#define GPIO_16_SPIA_SIMO               0x00080001U
#define GPIO_16_CANB_TX                 0x00080002U
#define GPIO_16_OUTPUTXBAR7             0x00080003U
#define GPIO_16_EPWM9A                  0x00080005U
#define GPIO_16_SD1_D1                  0x00080007U
#define GPIO_16_SSIA_TX                 0x0008000BU
#define GPIO_16_FSIRXD_D1               0x0008000DU

#define GPIO_17_GPIO17                  0x00080200U
#define GPIO_17_SPIA_SOMI               0x00080201U
#define GPIO_17_CANB_RX                 0x00080202U
#define GPIO_17_OUTPUTXBAR8             0x00080203U
#define GPIO_17_EPWM9B                  0x00080205U
#define GPIO_17_SD1_C1                  0x00080207U
#define GPIO_17_SSIA_RX                 0x0008020BU
#define GPIO_17_FSIRXD_CLK              0x0008020DU

#define GPIO_18_GPIO18                  0x00080400U
#define GPIO_18_SPIA_CLK                0x00080401U
#define GPIO_18_SCIB_TX                 0x00080402U
#define GPIO_18_CANA_RX                 0x00080403U
#define GPIO_18_EPWM10A                 0x00080405U
#define GPIO_18_SD1_D2                  0x00080407U
#define GPIO_18_MCAN_RX                 0x00080409U
#define GPIO_18_EMIF1_CS2N              0x0008040AU
#define GPIO_18_SSIA_CLK                0x0008040BU
#define GPIO_18_FSIRXE_D0               0x0008040DU

#define GPIO_19_GPIO19                  0x00080600U
#define GPIO_19_SPIA_STEN               0x00080601U
#define GPIO_19_SCIB_RX                 0x00080602U
#define GPIO_19_CANA_TX                 0x00080603U
#define GPIO_19_EPWM10B                 0x00080605U
#define GPIO_19_SD1_C2                  0x00080607U
#define GPIO_19_MCAN_TX                 0x00080609U
#define GPIO_19_EMIF1_CS3N              0x0008060AU
#define GPIO_19_SSIA_FSS                0x0008060BU
#define GPIO_19_FSIRXE_D1               0x0008060DU

#define GPIO_20_GPIO20                  0x00080800U
#define GPIO_20_EQEP1_A                 0x00080801U
#define GPIO_20_MDXA                    0x00080802U
#define GPIO_20_CANB_TX                 0x00080803U
#define GPIO_20_EPWM11A                 0x00080805U
#define GPIO_20_SD1_D3                  0x00080807U
#define GPIO_20_EMIF1_BA0               0x0008080AU
#define GPIO_20_TRACE_DATA0             0x0008080BU
#define GPIO_20_FSIRXE_CLK              0x0008080DU
#define GPIO_20_SPIC_SIMO               0x0008080EU

#define GPIO_21_GPIO21                  0x00080A00U
#define GPIO_21_EQEP1_B                 0x00080A01U
#define GPIO_21_MDRA                    0x00080A02U
#define GPIO_21_CANB_RX                 0x00080A03U
#define GPIO_21_EPWM11B                 0x00080A05U
#define GPIO_21_SD1_C3                  0x00080A07U
#define GPIO_21_EMIF1_BA1               0x00080A0AU
#define GPIO_21_TRACE_DATA1             0x00080A0BU
#define GPIO_21_FSIRXF_D0               0x00080A0DU
#define GPIO_21_SPIC_SOMI               0x00080A0EU

#define GPIO_22_GPIO22                  0x00080C00U
#define GPIO_22_EQEP1_STROBE            0x00080C01U
#define GPIO_22_MCLKXA                  0x00080C02U
#define GPIO_22_SCIB_TX                 0x00080C03U
#define GPIO_22_EPWM12A                 0x00080C05U
#define GPIO_22_SPIB_CLK                0x00080C06U
#define GPIO_22_SD1_D4                  0x00080C07U
#define GPIO_22_MCAN_TX                 0x00080C09U
#define GPIO_22_EMIF1_RAS               0x00080C0AU
#define GPIO_22_TRACE_DATA2             0x00080C0BU
#define GPIO_22_FSIRXF_D1               0x00080C0DU
#define GPIO_22_SPIC_CLK                0x00080C0EU

#define GPIO_23_GPIO23                  0x00080E00U
#define GPIO_23_EQEP1_INDEX             0x00080E01U
#define GPIO_23_MFSXA                   0x00080E02U
#define GPIO_23_SCIB_RX                 0x00080E03U
#define GPIO_23_EPWM12B                 0x00080E05U
#define GPIO_23_SPIB_STEN               0x00080E06U
#define GPIO_23_SD1_C4                  0x00080E07U
#define GPIO_23_MCAN_RX                 0x00080E09U
#define GPIO_23_EMIF1_CAS               0x00080E0AU
#define GPIO_23_TRACE_DATA3             0x00080E0BU
#define GPIO_23_FSIRXF_CLK              0x00080E0DU
#define GPIO_23_SPIC_STEN               0x00080E0EU

#define GPIO_24_GPIO24                  0x00081000U
#define GPIO_24_OUTPUTXBAR1             0x00081001U
#define GPIO_24_EQEP2_A                 0x00081002U
#define GPIO_24_MDXB                    0x00081003U
#define GPIO_24_SPIB_SIMO               0x00081006U
#define GPIO_24_SD2_D1                  0x00081007U
#define GPIO_24_PMBUSA_SCL              0x00081009U
#define GPIO_24_EMIF1_DQM0              0x0008100AU
#define GPIO_24_TRACE_CLK               0x0008100BU
#define GPIO_24_EPWM13A                 0x0008100DU
#define GPIO_24_FSIRXG_D0               0x0008100FU

#define GPIO_25_GPIO25                  0x00081200U
#define GPIO_25_OUTPUTXBAR2             0x00081201U
#define GPIO_25_EQEP2_B                 0x00081202U
#define GPIO_25_MDRB                    0x00081203U
#define GPIO_25_SPIB_SOMI               0x00081206U
#define GPIO_25_SD2_C1                  0x00081207U
#define GPIO_25_PMBUSA_SDA              0x00081209U
#define GPIO_25_EMIF1_DQM1              0x0008120AU
#define GPIO_25_TRACE_SWO               0x0008120BU
#define GPIO_25_EPWM13B                 0x0008120DU
#define GPIO_25_FSITXA_D1               0x0008120EU
#define GPIO_25_FSIRXG_D1               0x0008120FU

#define GPIO_26_GPIO26                  0x00081400U
#define GPIO_26_OUTPUTXBAR3             0x00081401U
#define GPIO_26_EQEP2_INDEX             0x00081402U
#define GPIO_26_MCLKXB                  0x00081403U
#define GPIO_26_SPIB_CLK                0x00081406U
#define GPIO_26_SD2_D2                  0x00081407U
#define GPIO_26_PMBUSA_ALERT            0x00081409U
#define GPIO_26_EMIF1_DQM2              0x0008140AU
#define GPIO_26_ESC_MDIO_CLK            0x0008140BU
#define GPIO_26_EPWM14A                 0x0008140DU
#define GPIO_26_FSITXA_D0               0x0008140EU
#define GPIO_26_FSIRXG_CLK              0x0008140FU

#define GPIO_27_GPIO27                  0x00081600U
#define GPIO_27_OUTPUTXBAR4             0x00081601U
#define GPIO_27_EQEP2_STROBE            0x00081602U
#define GPIO_27_MFSXB                   0x00081603U
#define GPIO_27_SPIB_STEN               0x00081606U
#define GPIO_27_SD2_C2                  0x00081607U
#define GPIO_27_PMBUSA_CTL              0x00081609U
#define GPIO_27_EMIF1_DQM3              0x0008160AU
#define GPIO_27_ESC_MDIO_DATA           0x0008160BU
#define GPIO_27_EPWM14B                 0x0008160DU
#define GPIO_27_FSITXA_CLK              0x0008160EU
#define GPIO_27_FSIRXH_D0               0x0008160FU

#define GPIO_28_GPIO28                  0x00081800U
#define GPIO_28_SCIA_RX                 0x00081801U
#define GPIO_28_EMIF1_CS4N              0x00081802U
#define GPIO_28_OUTPUTXBAR5             0x00081805U
#define GPIO_28_EQEP3_A                 0x00081806U
#define GPIO_28_SD2_D3                  0x00081807U
#define GPIO_28_EMIF1_CS2N              0x00081809U
#define GPIO_28_EPWM15A                 0x0008180DU
#define GPIO_28_FSIRXH_D1               0x0008180FU

#define GPIO_29_GPIO29                  0x00081A00U
#define GPIO_29_SCIA_TX                 0x00081A01U
#define GPIO_29_EMIF1_SDCKE             0x00081A02U
#define GPIO_29_OUTPUTXBAR6             0x00081A05U
#define GPIO_29_EQEP3_B                 0x00081A06U
#define GPIO_29_SD2_C3                  0x00081A07U
#define GPIO_29_EMIF1_CS3N              0x00081A09U
#define GPIO_29_ESC_LATCH0              0x00081A0AU
#define GPIO_29_ESC_I2C_SDA             0x00081A0BU
#define GPIO_29_EPWM15B                 0x00081A0DU
#define GPIO_29_ESC_SYNC0               0x00081A0EU
#define GPIO_29_FSIRXH_CLK              0x00081A0FU

#define GPIO_30_GPIO30                  0x00081C00U
#define GPIO_30_CANA_RX                 0x00081C01U
#define GPIO_30_EMIF1_CLK               0x00081C02U
#define GPIO_30_MCAN_RX                 0x00081C03U
#define GPIO_30_OUTPUTXBAR7             0x00081C05U
#define GPIO_30_EQEP3_STROBE            0x00081C06U
#define GPIO_30_SD2_D4                  0x00081C07U
#define GPIO_30_EMIF1_CS4N              0x00081C09U
#define GPIO_30_ESC_LATCH1              0x00081C0AU
#define GPIO_30_ESC_I2C_SCL             0x00081C0BU
#define GPIO_30_EPWM16A                 0x00081C0DU
#define GPIO_30_ESC_SYNC1               0x00081C0EU
#define GPIO_30_SPID_SIMO               0x00081C0FU

