TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib/pin_map.h
#define GPIO_31_GPIO31                  0x00081E00U
#define GPIO_31_CANA_TX                 0x00081E01U
#define GPIO_31_EMIF1_WEN               0x00081E02U
#define GPIO_31_MCAN_TX                 0x00081E03U
#define GPIO_31_OUTPUTXBAR8             0x00081E05U
#define GPIO_31_EQEP3_INDEX             0x00081E06U
#define GPIO_31_SD2_C4                  0x00081E07U
#define GPIO_31_EMIF1_RNW               0x00081E09U
#define GPIO_31_I2CA_SDA                0x00081E0AU
#define GPIO_31_CM_I2CA_SDA             0x00081E0BU
#define GPIO_31_EPWM16B                 0x00081E0DU
#define GPIO_31_SPID_SOMI               0x00081E0FU

#define GPIO_32_GPIO32                  0x00460000U
#define GPIO_32_I2CA_SDA                0x00460001U
#define GPIO_32_EMIF1_CS0N              0x00460002U
#define GPIO_32_SPIA_SIMO               0x00460003U
#define GPIO_32_CLB_OUTPUTXBAR1         0x00460007U
#define GPIO_32_EMIF1_OEN               0x00460009U
#define GPIO_32_I2CA_SCL                0x0046000AU
#define GPIO_32_CM_I2CA_SCL             0x0046000BU
#define GPIO_32_SPID_CLK                0x0046000FU

#define GPIO_33_GPIO33                  0x00460200U
#define GPIO_33_I2CA_SCL                0x00460201U
#define GPIO_33_EMIF1_RNW               0x00460202U
#define GPIO_33_SPIA_SOMI               0x00460203U
#define GPIO_33_CLB_OUTPUTXBAR2         0x00460207U
#define GPIO_33_EMIF1_BA0               0x00460209U
#define GPIO_33_SPID_STEN               0x0046020FU

#define GPIO_34_GPIO34                  0x00460400U
#define GPIO_34_OUTPUTXBAR1             0x00460401U
#define GPIO_34_EMIF1_CS2N              0x00460402U
#define GPIO_34_SPIA_CLK                0x00460403U
#define GPIO_34_I2CB_SDA                0x00460406U
#define GPIO_34_CLB_OUTPUTXBAR3         0x00460407U
#define GPIO_34_EMIF1_BA1               0x00460409U
#define GPIO_34_ESC_LATCH0              0x0046040AU
#define GPIO_34_ENET_MII_CRS            0x0046040BU
#define GPIO_34_SCIA_TX                 0x0046040DU
#define GPIO_34_ESC_SYNC0               0x0046040EU

#define GPIO_35_GPIO35                  0x00460600U
#define GPIO_35_SCIA_RX                 0x00460601U
#define GPIO_35_EMIF1_CS3N              0x00460602U
#define GPIO_35_SPIA_STEN               0x00460603U
#define GPIO_35_I2CB_SCL                0x00460606U
#define GPIO_35_CLB_OUTPUTXBAR4         0x00460607U
#define GPIO_35_EMIF1_A0                0x00460609U
#define GPIO_35_ESC_LATCH1              0x0046060AU
#define GPIO_35_ENET_MII_COL            0x0046060BU
#define GPIO_35_ESC_SYNC1               0x0046060EU

#define GPIO_36_GPIO36                  0x00460800U
#define GPIO_36_SCIA_TX                 0x00460801U
#define GPIO_36_EMIF1_WAIT              0x00460802U
#define GPIO_36_CANA_RX                 0x00460806U
#define GPIO_36_CLB_OUTPUTXBAR5         0x00460807U
#define GPIO_36_EMIF1_A1                0x00460809U
#define GPIO_36_MCAN_RX                 0x0046080AU
#define GPIO_36_SD1_D1                  0x0046080DU

#define GPIO_37_GPIO37                  0x00460A00U
#define GPIO_37_OUTPUTXBAR2             0x00460A01U
#define GPIO_37_EMIF1_OEN               0x00460A02U
#define GPIO_37_CANA_TX                 0x00460A06U
#define GPIO_37_CLB_OUTPUTXBAR6         0x00460A07U
#define GPIO_37_EMIF1_A2                0x00460A09U
#define GPIO_37_MCAN_TX                 0x00460A0AU
#define GPIO_37_SD1_D2                  0x00460A0DU

#define GPIO_38_GPIO38                  0x00460C00U
#define GPIO_38_EMIF1_A0                0x00460C02U
#define GPIO_38_SCIC_TX                 0x00460C05U
#define GPIO_38_CANB_TX                 0x00460C06U
#define GPIO_38_CLB_OUTPUTXBAR7         0x00460C07U
#define GPIO_38_EMIF1_A3                0x00460C09U
#define GPIO_38_ENET_MII_RX_DV          0x00460C0AU
#define GPIO_38_ENET_MII_CRS            0x00460C0BU
#define GPIO_38_SD1_D3                  0x00460C0DU

#define GPIO_39_GPIO39                  0x00460E00U
#define GPIO_39_EMIF1_A1                0x00460E02U
#define GPIO_39_SCIC_RX                 0x00460E05U
#define GPIO_39_CANB_RX                 0x00460E06U
#define GPIO_39_CLB_OUTPUTXBAR8         0x00460E07U
#define GPIO_39_EMIF1_A4                0x00460E09U
#define GPIO_39_ENET_MII_RX_ERR         0x00460E0AU
#define GPIO_39_ENET_MII_COL            0x00460E0BU
#define GPIO_39_SD1_D4                  0x00460E0DU

#define GPIO_40_GPIO40                  0x00461000U
#define GPIO_40_EMIF1_A2                0x00461002U
#define GPIO_40_I2CB_SDA                0x00461006U
#define GPIO_40_ENET_MII_CRS            0x0046100BU
#define GPIO_40_ESC_I2C_SDA             0x0046100EU

#define GPIO_41_GPIO41                  0x00461200U
#define GPIO_41_EMIF1_A3                0x00461202U
#define GPIO_41_I2CB_SCL                0x00461206U
#define GPIO_41_ENET_REVMII_MDIO_RST    0x0046120AU
#define GPIO_41_ENET_MII_COL            0x0046120BU
#define GPIO_41_ESC_I2C_SCL             0x0046120EU

#define GPIO_42_GPIO42                  0x00461400U
#define GPIO_42_I2CA_SDA                0x00461406U
#define GPIO_42_ENET_MDIO_CLK           0x0046140AU
#define GPIO_42_UARTA_TX                0x0046140BU
#define GPIO_42_SCIA_TX                 0x0046140FU

#define GPIO_43_GPIO43                  0x00461600U
#define GPIO_43_I2CA_SCL                0x00461606U
#define GPIO_43_ENET_MDIO_DATA          0x0046160AU
#define GPIO_43_UARTA_RX                0x0046160BU
#define GPIO_43_SCIA_RX                 0x0046160FU

#define GPIO_44_GPIO44                  0x00461800U
#define GPIO_44_EMIF1_A4                0x00461802U
#define GPIO_44_ENET_MII_TX_CLK         0x0046180BU
#define GPIO_44_ESC_TX1_CLK             0x0046180EU

#define GPIO_45_GPIO45                  0x00461A00U
#define GPIO_45_EMIF1_A5                0x00461A02U
#define GPIO_45_ENET_MII_TX_EN          0x00461A0BU
#define GPIO_45_ESC_TX1_ENA             0x00461A0EU

#define GPIO_46_GPIO46                  0x00461C00U
#define GPIO_46_EMIF1_A6                0x00461C02U
#define GPIO_46_SCID_RX                 0x00461C06U
#define GPIO_46_ENET_MII_TX_ERR         0x00461C0BU
#define GPIO_46_ESC_MDIO_CLK            0x00461C0EU

