TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib/pin_map.h
#define GPIO_61_GPIO61                  0x00481A00U
#define GPIO_61_MFSRB                   0x00481A01U
#define GPIO_61_EMIF1_D23               0x00481A02U
#define GPIO_61_EMIF2_D7                0x00481A03U
#define GPIO_61_OUTPUTXBAR4             0x00481A05U
#define GPIO_61_SPIB_SOMI               0x00481A06U
#define GPIO_61_SD2_C3                  0x00481A07U
#define GPIO_61_EMIF1_D6                0x00481A09U
#define GPIO_61_ESC_LED_RUN             0x00481A0AU
#define GPIO_61_ENET_MII_TX_DATA2       0x00481A0BU
#define GPIO_61_CANA_RX                 0x00481A0EU
#define GPIO_61_SPIA_STEN               0x00481A0FU

#define GPIO_62_GPIO62                  0x00481C00U
#define GPIO_62_SCIC_RX                 0x00481C01U
#define GPIO_62_EMIF1_D22               0x00481C02U
#define GPIO_62_EMIF2_D6                0x00481C03U
#define GPIO_62_EQEP3_A                 0x00481C05U
#define GPIO_62_CANA_RX                 0x00481C06U
#define GPIO_62_SD2_D4                  0x00481C07U
#define GPIO_62_EMIF1_D7                0x00481C09U
#define GPIO_62_ESC_LED_STATE_RUN       0x00481C0AU
#define GPIO_62_ENET_MII_TX_DATA3       0x00481C0BU
#define GPIO_62_CANA_TX                 0x00481C0EU

#define GPIO_63_GPIO63                  0x00481E00U
#define GPIO_63_SCIC_TX                 0x00481E01U
#define GPIO_63_EMIF1_D21               0x00481E02U
#define GPIO_63_EMIF2_D5                0x00481E03U
#define GPIO_63_EQEP3_B                 0x00481E05U
#define GPIO_63_CANA_TX                 0x00481E06U
#define GPIO_63_SD2_C4                  0x00481E07U
#define GPIO_63_SSIA_TX                 0x00481E09U
#define GPIO_63_ENET_MII_RX_DATA0       0x00481E0BU
#define GPIO_63_SD1_D1                  0x00481E0DU
#define GPIO_63_ESC_RX1_DATA0           0x00481E0EU
#define GPIO_63_SPIB_SIMO               0x00481E0FU

#define GPIO_64_GPIO64                  0x00860000U
#define GPIO_64_EMIF1_D20               0x00860002U
#define GPIO_64_EMIF2_D4                0x00860003U
#define GPIO_64_EQEP3_STROBE            0x00860005U
#define GPIO_64_SCIA_RX                 0x00860006U
#define GPIO_64_SSIA_RX                 0x00860009U
#define GPIO_64_ENET_MII_RX_DV          0x0086000AU
#define GPIO_64_ENET_MII_RX_DATA1       0x0086000BU
#define GPIO_64_SD1_C1                  0x0086000DU
#define GPIO_64_ESC_RX1_DATA1           0x0086000EU
#define GPIO_64_SPIB_SOMI               0x0086000FU

#define GPIO_65_GPIO65                  0x00860200U
#define GPIO_65_EMIF1_D19               0x00860202U
#define GPIO_65_EMIF2_D3                0x00860203U
#define GPIO_65_EQEP3_INDEX             0x00860205U
#define GPIO_65_SCIA_TX                 0x00860206U
#define GPIO_65_SSIA_CLK                0x00860209U
#define GPIO_65_ENET_MII_RX_ERR         0x0086020AU
#define GPIO_65_ENET_MII_RX_DATA2       0x0086020BU
#define GPIO_65_SD1_D2                  0x0086020DU
#define GPIO_65_ESC_RX1_DATA2           0x0086020EU
#define GPIO_65_SPIB_CLK                0x0086020FU

#define GPIO_66_GPIO66                  0x00860400U
#define GPIO_66_EMIF1_D18               0x00860402U
#define GPIO_66_EMIF2_D2                0x00860403U
#define GPIO_66_I2CB_SDA                0x00860406U
#define GPIO_66_SSIA_FSS                0x00860409U
#define GPIO_66_ENET_MII_RX_DATA0       0x0086040AU
#define GPIO_66_ENET_MII_RX_DATA3       0x0086040BU
#define GPIO_66_SD1_C2                  0x0086040DU
#define GPIO_66_ESC_RX1_DATA3           0x0086040EU
#define GPIO_66_SPIB_STEN               0x0086040FU

#define GPIO_67_GPIO67                  0x00860600U
#define GPIO_67_EMIF1_D17               0x00860602U
#define GPIO_67_EMIF2_D1                0x00860603U
#define GPIO_67_ENET_MII_RX_CLK         0x0086060AU
#define GPIO_67_ENET_REVMII_MDIO_RST    0x0086060BU
#define GPIO_67_SD1_D3                  0x0086060DU

#define GPIO_68_GPIO68                  0x00860800U
#define GPIO_68_EMIF1_D16               0x00860802U
#define GPIO_68_EMIF2_D0                0x00860803U
#define GPIO_68_ENET_MII_INTR           0x0086080BU
#define GPIO_68_SD1_C3                  0x0086080DU
#define GPIO_68_ESC_PHY1_LINKSTATUS     0x0086080EU

#define GPIO_69_GPIO69                  0x00860A00U
#define GPIO_69_EMIF1_D15               0x00860A02U
#define GPIO_69_I2CB_SCL                0x00860A06U
#define GPIO_69_ENET_MII_TX_EN          0x00860A0AU
#define GPIO_69_ENET_MII_RX_CLK         0x00860A0BU
#define GPIO_69_SD1_D4                  0x00860A0DU
#define GPIO_69_ESC_RX1_CLK             0x00860A0EU
#define GPIO_69_SPIC_SIMO               0x00860A0FU

#define GPIO_70_GPIO70                  0x00860C00U
#define GPIO_70_EMIF1_D14               0x00860C02U
#define GPIO_70_CANA_RX                 0x00860C05U
#define GPIO_70_SCIB_TX                 0x00860C06U
#define GPIO_70_MCAN_RX                 0x00860C09U
#define GPIO_70_ENET_MII_RX_DV          0x00860C0BU
#define GPIO_70_SD1_C4                  0x00860C0DU
#define GPIO_70_ESC_RX1_DV              0x00860C0EU
#define GPIO_70_SPIC_SOMI               0x00860C0FU

#define GPIO_71_GPIO71                  0x00860E00U
#define GPIO_71_EMIF1_D13               0x00860E02U
#define GPIO_71_CANA_TX                 0x00860E05U
#define GPIO_71_SCIB_RX                 0x00860E06U
#define GPIO_71_MCAN_TX                 0x00860E09U
#define GPIO_71_ENET_MII_RX_DATA0       0x00860E0AU
#define GPIO_71_ENET_MII_RX_ERR         0x00860E0BU
#define GPIO_71_ESC_RX1_ERR             0x00860E0EU
#define GPIO_71_SPIC_CLK                0x00860E0FU

#define GPIO_72_GPIO72                  0x00861000U
#define GPIO_72_EMIF1_D12               0x00861002U
#define GPIO_72_CANB_TX                 0x00861005U
#define GPIO_72_SCIC_TX                 0x00861006U
#define GPIO_72_ENET_MII_RX_DATA1       0x0086100AU
#define GPIO_72_ENET_MII_TX_DATA3       0x0086100BU
#define GPIO_72_ESC_TX1_DATA3           0x0086100EU
#define GPIO_72_SPIC_STEN               0x0086100FU

#define GPIO_73_GPIO73                  0x00861200U
#define GPIO_73_EMIF1_D11               0x00861202U
#define GPIO_73_XCLKOUT                 0x00861203U
#define GPIO_73_CANB_RX                 0x00861205U
#define GPIO_73_SCIC_RX                 0x00861206U
#define GPIO_73_ENET_RMII_CLK           0x0086120AU
#define GPIO_73_ENET_MII_TX_DATA2       0x0086120BU
#define GPIO_73_SD2_D2                  0x0086120DU
#define GPIO_73_ESC_TX1_DATA2           0x0086120EU

#define GPIO_74_GPIO74                  0x00861400U
#define GPIO_74_EMIF1_D10               0x00861402U
#define GPIO_74_MCAN_TX                 0x00861409U
#define GPIO_74_ENET_MII_TX_DATA1       0x0086140BU
#define GPIO_74_SD2_C2                  0x0086140DU
#define GPIO_74_ESC_TX1_DATA1           0x0086140EU

#define GPIO_75_GPIO75                  0x00861600U
#define GPIO_75_EMIF1_D9                0x00861602U
#define GPIO_75_MCAN_RX                 0x00861609U
#define GPIO_75_ENET_MII_TX_DATA0       0x0086160BU
#define GPIO_75_SD2_D3                  0x0086160DU
#define GPIO_75_ESC_TX1_DATA0           0x0086160EU

#define GPIO_76_GPIO76                  0x00861800U
#define GPIO_76_EMIF1_D8                0x00861802U
#define GPIO_76_SCID_TX                 0x00861806U
#define GPIO_76_ENET_MII_RX_ERR         0x0086180AU
#define GPIO_76_SD2_C3                  0x0086180DU
#define GPIO_76_ESC_PHY_RESETN          0x0086180EU

#define GPIO_77_GPIO77                  0x00861A00U
#define GPIO_77_EMIF1_D7                0x00861A02U
#define GPIO_77_SCID_RX                 0x00861A06U
#define GPIO_77_SD2_D4                  0x00861A0DU
#define GPIO_77_ESC_RX0_CLK             0x00861A0EU

