TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib/pin_map.h
#define GPIO_78_GPIO78                  0x00861C00U
#define GPIO_78_EMIF1_D6                0x00861C02U
#define GPIO_78_EQEP2_A                 0x00861C06U
#define GPIO_78_SD2_C4                  0x00861C0DU
#define GPIO_78_ESC_RX0_DV              0x00861C0EU

#define GPIO_79_GPIO79                  0x00861E00U
#define GPIO_79_EMIF1_D5                0x00861E02U
#define GPIO_79_EQEP2_B                 0x00861E06U
#define GPIO_79_SD2_D1                  0x00861E0DU
#define GPIO_79_ESC_RX0_ERR             0x00861E0EU

#define GPIO_80_GPIO80                  0x00880000U
#define GPIO_80_EMIF1_D4                0x00880002U
#define GPIO_80_EQEP2_STROBE            0x00880006U
#define GPIO_80_SD2_C1                  0x0088000DU
#define GPIO_80_ESC_RX0_DATA0           0x0088000EU

#define GPIO_81_GPIO81                  0x00880200U
#define GPIO_81_EMIF1_D3                0x00880202U
#define GPIO_81_EQEP2_INDEX             0x00880206U
#define GPIO_81_ESC_RX0_DATA1           0x0088020EU

#define GPIO_82_GPIO82                  0x00880400U
#define GPIO_82_EMIF1_D2                0x00880402U
#define GPIO_82_ESC_RX0_DATA2           0x0088040EU

#define GPIO_83_GPIO83                  0x00880600U
#define GPIO_83_EMIF1_D1                0x00880602U
#define GPIO_83_ESC_RX0_DATA3           0x0088060EU

#define GPIO_84_GPIO84                  0x00880800U
#define GPIO_84_SCIA_TX                 0x00880805U
#define GPIO_84_MDXB                    0x00880806U
#define GPIO_84_UARTA_TX                0x0088080BU
#define GPIO_84_ESC_TX0_ENA             0x0088080EU
#define GPIO_84_MDXA                    0x0088080FU

#define GPIO_85_GPIO85                  0x00880A00U
#define GPIO_85_EMIF1_D0                0x00880A02U
#define GPIO_85_SCIA_RX                 0x00880A05U
#define GPIO_85_MDRB                    0x00880A06U
#define GPIO_85_UARTA_RX                0x00880A0BU
#define GPIO_85_ESC_TX0_CLK             0x00880A0EU
#define GPIO_85_MDRA                    0x00880A0FU

#define GPIO_86_GPIO86                  0x00880C00U
#define GPIO_86_EMIF1_A13               0x00880C02U
#define GPIO_86_EMIF1_CAS               0x00880C03U
#define GPIO_86_SCIB_TX                 0x00880C05U
#define GPIO_86_MCLKXB                  0x00880C06U
#define GPIO_86_ESC_PHY0_LINKSTATUS     0x00880C0EU
#define GPIO_86_MCLKXA                  0x00880C0FU

#define GPIO_87_GPIO87                  0x00880E00U
#define GPIO_87_EMIF1_A14               0x00880E02U
#define GPIO_87_EMIF1_RAS               0x00880E03U
#define GPIO_87_SCIB_RX                 0x00880E05U
#define GPIO_87_MFSXB                   0x00880E06U
#define GPIO_87_EMIF1_DQM3              0x00880E09U
#define GPIO_87_ESC_TX0_DATA0           0x00880E0EU
#define GPIO_87_MFSXA                   0x00880E0FU

#define GPIO_88_GPIO88                  0x00881000U
#define GPIO_88_EMIF1_A15               0x00881002U
#define GPIO_88_EMIF1_DQM0              0x00881003U
#define GPIO_88_EMIF1_DQM1              0x00881009U
#define GPIO_88_ESC_TX0_DATA1           0x0088100EU

#define GPIO_89_GPIO89                  0x00881200U
#define GPIO_89_EMIF1_A16               0x00881202U
#define GPIO_89_EMIF1_DQM1              0x00881203U
#define GPIO_89_SCIC_TX                 0x00881206U
#define GPIO_89_EMIF1_CAS               0x00881209U
#define GPIO_89_ESC_TX0_DATA2           0x0088120EU

#define GPIO_90_GPIO90                  0x00881400U
#define GPIO_90_EMIF1_A17               0x00881402U
#define GPIO_90_EMIF1_DQM2              0x00881403U
#define GPIO_90_SCIC_RX                 0x00881406U
#define GPIO_90_EMIF1_RAS               0x00881409U
#define GPIO_90_ESC_TX0_DATA3           0x0088140EU

#define GPIO_91_GPIO91                  0x00881600U
#define GPIO_91_EMIF1_A18               0x00881602U
#define GPIO_91_EMIF1_DQM3              0x00881603U
#define GPIO_91_I2CA_SDA                0x00881606U
#define GPIO_91_EMIF1_DQM2              0x00881609U
#define GPIO_91_PMBUSA_SCL              0x0088160AU
#define GPIO_91_SSIA_TX                 0x0088160BU
#define GPIO_91_FSIRXF_D0               0x0088160DU
#define GPIO_91_CLB_OUTPUTXBAR1         0x0088160EU
#define GPIO_91_SPID_SIMO               0x0088160FU

#define GPIO_92_GPIO92                  0x00881800U
#define GPIO_92_EMIF1_A19               0x00881802U
#define GPIO_92_EMIF1_BA1               0x00881803U
#define GPIO_92_I2CA_SCL                0x00881806U
#define GPIO_92_EMIF1_DQM0              0x00881809U
#define GPIO_92_PMBUSA_SDA              0x0088180AU
#define GPIO_92_SSIA_RX                 0x0088180BU
#define GPIO_92_FSIRXF_D1               0x0088180DU
#define GPIO_92_CLB_OUTPUTXBAR2         0x0088180EU
#define GPIO_92_SPID_SOMI               0x0088180FU

#define GPIO_93_GPIO93                  0x00881A00U
#define GPIO_93_EMIF1_BA0               0x00881A03U
#define GPIO_93_SCID_TX                 0x00881A06U
#define GPIO_93_PMBUSA_ALERT            0x00881A0AU
#define GPIO_93_SSIA_CLK                0x00881A0BU
#define GPIO_93_FSIRXF_CLK              0x00881A0DU
#define GPIO_93_CLB_OUTPUTXBAR3         0x00881A0EU
#define GPIO_93_SPID_CLK                0x00881A0FU

#define GPIO_94_GPIO94                  0x00881C00U
#define GPIO_94_SCID_RX                 0x00881C06U
#define GPIO_94_EMIF1_BA1               0x00881C09U
#define GPIO_94_PMBUSA_CTL              0x00881C0AU
#define GPIO_94_SSIA_FSS                0x00881C0BU
#define GPIO_94_FSIRXG_D0               0x00881C0DU
#define GPIO_94_CLB_OUTPUTXBAR4         0x00881C0EU
#define GPIO_94_SPID_STEN               0x00881C0FU

#define GPIO_95_GPIO95                  0x00881E00U
#define GPIO_95_EMIF2_A12               0x00881E03U
#define GPIO_95_FSIRXG_D1               0x00881E0DU
#define GPIO_95_CLB_OUTPUTXBAR5         0x00881E0EU

#define GPIO_96_GPIO96                  0x00C60000U
#define GPIO_96_EMIF2_DQM1              0x00C60003U
#define GPIO_96_EQEP1_A                 0x00C60005U
#define GPIO_96_FSIRXG_CLK              0x00C6000DU
#define GPIO_96_CLB_OUTPUTXBAR6         0x00C6000EU

#define GPIO_97_GPIO97                  0x00C60200U
#define GPIO_97_EMIF2_DQM0              0x00C60203U
#define GPIO_97_EQEP1_B                 0x00C60205U
#define GPIO_97_FSIRXH_D0               0x00C6020DU
#define GPIO_97_CLB_OUTPUTXBAR7         0x00C6020EU

#define GPIO_98_GPIO98                  0x00C60400U
#define GPIO_98_EMIF2_A0                0x00C60403U
#define GPIO_98_EQEP1_STROBE            0x00C60405U
#define GPIO_98_FSIRXH_D1               0x00C6040DU
#define GPIO_98_CLB_OUTPUTXBAR8         0x00C6040EU

#define GPIO_99_GPIO99                  0x00C60600U
#define GPIO_99_EMIF2_A1                0x00C60603U
#define GPIO_99_EQEP1_INDEX             0x00C60605U
#define GPIO_99_FSIRXH_CLK              0x00C6060DU

#define GPIO_100_GPIO100                0x00C60800U
#define GPIO_100_EMIF2_A2               0x00C60803U
#define GPIO_100_EQEP2_A                0x00C60805U
#define GPIO_100_SPIC_SIMO              0x00C60806U
#define GPIO_100_ESC_GPI0               0x00C6080AU
#define GPIO_100_FSITXA_D0              0x00C6080DU

#define GPIO_101_GPIO101                0x00C60A00U
#define GPIO_101_EMIF2_A3               0x00C60A03U
#define GPIO_101_EQEP2_B                0x00C60A05U
#define GPIO_101_SPIC_SOMI              0x00C60A06U
#define GPIO_101_ESC_GPI1               0x00C60A0AU
#define GPIO_101_FSITXA_D1              0x00C60A0DU

#define GPIO_102_GPIO102                0x00C60C00U
#define GPIO_102_EMIF2_A4               0x00C60C03U
#define GPIO_102_EQEP2_STROBE           0x00C60C05U
#define GPIO_102_SPIC_CLK               0x00C60C06U
#define GPIO_102_ESC_GPI2               0x00C60C0AU
#define GPIO_102_FSITXA_CLK             0x00C60C0DU

#define GPIO_103_GPIO103                0x00C60E00U
#define GPIO_103_EMIF2_A5               0x00C60E03U
#define GPIO_103_EQEP2_INDEX            0x00C60E05U
#define GPIO_103_SPIC_STEN              0x00C60E06U
#define GPIO_103_ESC_GPI3               0x00C60E0AU
#define GPIO_103_FSIRXA_D0              0x00C60E0DU

#define GPIO_104_GPIO104                0x00C61000U
#define GPIO_104_I2CA_SDA               0x00C61001U
#define GPIO_104_EMIF2_A6               0x00C61003U
#define GPIO_104_EQEP3_A                0x00C61005U
#define GPIO_104_SCID_TX                0x00C61006U
#define GPIO_104_ESC_GPI4               0x00C6100AU
#define GPIO_104_CM_I2CA_SDA            0x00C6100BU
#define GPIO_104_FSIRXA_D1              0x00C6100DU

