TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib/pin_map.h
#define GPIO_105_GPIO105                0x00C61200U
#define GPIO_105_I2CA_SCL               0x00C61201U
#define GPIO_105_EMIF2_A7               0x00C61203U
#define GPIO_105_EQEP3_B                0x00C61205U
#define GPIO_105_SCID_RX                0x00C61206U
#define GPIO_105_ESC_GPI5               0x00C6120AU
#define GPIO_105_CM_I2CA_SCL            0x00C6120BU
#define GPIO_105_FSIRXA_CLK             0x00C6120DU
#define GPIO_105_ENET_MDIO_CLK          0x00C6120EU

#define GPIO_106_GPIO106                0x00C61400U
#define GPIO_106_EMIF2_A8               0x00C61403U
#define GPIO_106_EQEP3_STROBE           0x00C61405U
#define GPIO_106_SCIC_TX                0x00C61406U
#define GPIO_106_ESC_GPI6               0x00C6140AU
#define GPIO_106_FSITXB_D0              0x00C6140DU
#define GPIO_106_ENET_MDIO_DATA         0x00C6140EU

#define GPIO_107_GPIO107                0x00C61600U
#define GPIO_107_EMIF2_A9               0x00C61603U
#define GPIO_107_EQEP3_INDEX            0x00C61605U
#define GPIO_107_SCIC_RX                0x00C61606U
#define GPIO_107_ESC_GPI7               0x00C6160AU
#define GPIO_107_FSITXB_D1              0x00C6160DU
#define GPIO_107_ENET_REVMII_MDIO_RST   0x00C6160EU

#define GPIO_108_GPIO108                0x00C61800U
#define GPIO_108_EMIF2_A10              0x00C61803U
#define GPIO_108_ESC_GPI8               0x00C6180AU
#define GPIO_108_FSITXB_CLK             0x00C6180DU
#define GPIO_108_ENET_MII_INTR          0x00C6180EU

#define GPIO_109_GPIO109                0x00C61A00U
#define GPIO_109_EMIF2_A11              0x00C61A03U
#define GPIO_109_ESC_GPI9               0x00C61A0AU
#define GPIO_109_ENET_MII_CRS           0x00C61A0EU

#define GPIO_110_GPIO110                0x00C61C00U
#define GPIO_110_EMIF2_WAIT             0x00C61C03U
#define GPIO_110_ESC_GPI10              0x00C61C0AU
#define GPIO_110_FSIRXB_D0              0x00C61C0DU
#define GPIO_110_ENET_MII_COL           0x00C61C0EU

#define GPIO_111_GPIO111                0x00C61E00U
#define GPIO_111_EMIF2_BA0              0x00C61E03U
#define GPIO_111_ESC_GPI11              0x00C61E0AU
#define GPIO_111_FSIRXB_D1              0x00C61E0DU
#define GPIO_111_ENET_MII_RX_CLK        0x00C61E0EU

#define GPIO_112_GPIO112                0x00C80000U
#define GPIO_112_EMIF2_BA1              0x00C80003U
#define GPIO_112_ESC_GPI12              0x00C8000AU
#define GPIO_112_FSIRXB_CLK             0x00C8000DU
#define GPIO_112_ENET_MII_RX_DV         0x00C8000EU

#define GPIO_113_GPIO113                0x00C80200U
#define GPIO_113_EMIF2_CAS              0x00C80203U
#define GPIO_113_ESC_GPI13              0x00C8020AU
#define GPIO_113_ENET_MII_RX_ERR        0x00C8020EU

#define GPIO_114_GPIO114                0x00C80400U
#define GPIO_114_EMIF2_RAS              0x00C80403U
#define GPIO_114_ESC_GPI14              0x00C8040AU
#define GPIO_114_ENET_MII_RX_DATA0      0x00C8040EU

#define GPIO_115_GPIO115                0x00C80600U
#define GPIO_115_EMIF2_CS0N             0x00C80603U
#define GPIO_115_OUTPUTXBAR5            0x00C80605U
#define GPIO_115_ESC_GPI15              0x00C8060AU
#define GPIO_115_FSIRXC_D0              0x00C8060DU
#define GPIO_115_ENET_MII_RX_DATA1      0x00C8060EU

#define GPIO_116_GPIO116                0x00C80800U
#define GPIO_116_EMIF2_CS2N             0x00C80803U
#define GPIO_116_OUTPUTXBAR6            0x00C80805U
#define GPIO_116_ESC_GPI16              0x00C8080AU
#define GPIO_116_FSIRXC_D1              0x00C8080DU
#define GPIO_116_ENET_MII_RX_DATA2      0x00C8080EU

#define GPIO_117_GPIO117                0x00C80A00U
#define GPIO_117_EMIF2_SDCKE            0x00C80A03U
#define GPIO_117_ESC_GPI17              0x00C80A0AU
#define GPIO_117_FSIRXC_CLK             0x00C80A0DU
#define GPIO_117_ENET_MII_RX_DATA3      0x00C80A0EU

#define GPIO_118_GPIO118                0x00C80C00U
#define GPIO_118_EMIF2_CLK              0x00C80C03U
#define GPIO_118_ESC_GPI18              0x00C80C0AU
#define GPIO_118_FSIRXD_D0              0x00C80C0DU
#define GPIO_118_ENET_MII_TX_EN         0x00C80C0EU

#define GPIO_119_GPIO119                0x00C80E00U
#define GPIO_119_EMIF2_RNW              0x00C80E03U
#define GPIO_119_ESC_GPI19              0x00C80E0AU
#define GPIO_119_FSIRXD_D1              0x00C80E0DU
#define GPIO_119_ENET_MII_TX_ERR        0x00C80E0EU

#define GPIO_120_GPIO120                0x00C81000U
#define GPIO_120_EMIF2_WEN              0x00C81003U
#define GPIO_120_ESC_GPI20              0x00C8100AU
#define GPIO_120_FSIRXD_CLK             0x00C8100DU
#define GPIO_120_ENET_MII_TX_CLK        0x00C8100EU

#define GPIO_121_GPIO121                0x00C81200U
#define GPIO_121_EMIF2_OEN              0x00C81203U
#define GPIO_121_ESC_GPI21              0x00C8120AU
#define GPIO_121_FSIRXE_D0              0x00C8120DU
#define GPIO_121_ENET_MII_TX_DATA0      0x00C8120EU

#define GPIO_122_GPIO122                0x00C81400U
#define GPIO_122_EMIF2_D15              0x00C81403U
#define GPIO_122_SPIC_SIMO              0x00C81406U
#define GPIO_122_SD1_D1                 0x00C81407U
#define GPIO_122_ESC_GPI22              0x00C8140AU
#define GPIO_122_ENET_MII_TX_DATA1      0x00C8140EU

#define GPIO_123_GPIO123                0x00C81600U
#define GPIO_123_EMIF2_D14              0x00C81603U
#define GPIO_123_SPIC_SOMI              0x00C81606U
#define GPIO_123_SD1_C1                 0x00C81607U
#define GPIO_123_ESC_GPI23              0x00C8160AU
#define GPIO_123_ENET_MII_TX_DATA2      0x00C8160EU

#define GPIO_124_GPIO124                0x00C81800U
#define GPIO_124_EMIF2_D13              0x00C81803U
#define GPIO_124_SPIC_CLK               0x00C81806U
#define GPIO_124_SD1_D2                 0x00C81807U
#define GPIO_124_ESC_GPI24              0x00C8180AU
#define GPIO_124_ENET_MII_TX_DATA3      0x00C8180EU

#define GPIO_125_GPIO125                0x00C81A00U
#define GPIO_125_EMIF2_D12              0x00C81A03U
#define GPIO_125_SPIC_STEN              0x00C81A06U
#define GPIO_125_SD1_C2                 0x00C81A07U
#define GPIO_125_ESC_GPI25              0x00C81A0AU
#define GPIO_125_FSIRXE_D1              0x00C81A0DU
#define GPIO_125_ESC_LATCH0             0x00C81A0EU

#define GPIO_126_GPIO126                0x00C81C00U
#define GPIO_126_EMIF2_D11              0x00C81C03U
#define GPIO_126_SD1_D3                 0x00C81C07U
#define GPIO_126_ESC_GPI26              0x00C81C0AU
#define GPIO_126_FSIRXE_CLK             0x00C81C0DU
#define GPIO_126_ESC_LATCH1             0x00C81C0EU

#define GPIO_127_GPIO127                0x00C81E00U
#define GPIO_127_EMIF2_D10              0x00C81E03U
#define GPIO_127_SD1_C3                 0x00C81E07U
#define GPIO_127_ESC_GPI27              0x00C81E0AU
#define GPIO_127_ESC_SYNC0              0x00C81E0EU

#define GPIO_128_GPIO128                0x01060000U
#define GPIO_128_EMIF2_D9               0x01060003U
#define GPIO_128_SD1_D4                 0x01060007U
#define GPIO_128_ESC_GPI28              0x0106000AU
#define GPIO_128_ESC_SYNC1              0x0106000EU

#define GPIO_129_GPIO129                0x01060200U
#define GPIO_129_EMIF2_D8               0x01060203U
#define GPIO_129_SD1_C4                 0x01060207U
#define GPIO_129_ESC_GPI29              0x0106020AU
#define GPIO_129_ESC_TX1_ENA            0x0106020EU

#define GPIO_130_GPIO130                0x01060400U
#define GPIO_130_EMIF2_D7               0x01060403U
#define GPIO_130_SD2_D1                 0x01060407U
#define GPIO_130_ESC_GPI30              0x0106040AU
#define GPIO_130_ESC_TX1_CLK            0x0106040EU

