TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/driverlib/pin_map.h
#define GPIO_131_GPIO131                0x01060600U
#define GPIO_131_EMIF2_D6               0x01060603U
#define GPIO_131_SD2_C1                 0x01060607U
#define GPIO_131_ESC_GPI31              0x0106060AU
#define GPIO_131_ESC_TX1_DATA0          0x0106060EU

#define GPIO_132_GPIO132                0x01060800U
#define GPIO_132_EMIF2_D5               0x01060803U
#define GPIO_132_SD2_D2                 0x01060807U
#define GPIO_132_ESC_GPO0               0x0106080AU
#define GPIO_132_ESC_TX1_DATA1          0x0106080EU

#define GPIO_133_GPIO133                0x01060A00U
#define GPIO_133_SD2_C2                 0x01060A07U

#define GPIO_134_GPIO134                0x01060C00U
#define GPIO_134_EMIF2_D4               0x01060C03U
#define GPIO_134_SD2_D3                 0x01060C07U
#define GPIO_134_ESC_GPO1               0x01060C0AU
#define GPIO_134_ESC_TX1_DATA2          0x01060C0EU

#define GPIO_135_GPIO135                0x01060E00U
#define GPIO_135_EMIF2_D3               0x01060E03U
#define GPIO_135_SCIA_TX                0x01060E06U
#define GPIO_135_SD2_C3                 0x01060E07U
#define GPIO_135_ESC_GPO2               0x01060E0AU
#define GPIO_135_ESC_TX1_DATA3          0x01060E0EU

#define GPIO_136_GPIO136                0x01061000U
#define GPIO_136_EMIF2_D2               0x01061003U
#define GPIO_136_SCIA_RX                0x01061006U
#define GPIO_136_SD2_D4                 0x01061007U
#define GPIO_136_ESC_GPO3               0x0106100AU
#define GPIO_136_ESC_RX1_DV             0x0106100EU

#define GPIO_137_GPIO137                0x01061200U
#define GPIO_137_EPWM13A                0x01061201U
#define GPIO_137_EMIF2_D1               0x01061203U
#define GPIO_137_SCIB_TX                0x01061206U
#define GPIO_137_SD2_C4                 0x01061207U
#define GPIO_137_ESC_GPO4               0x0106120AU
#define GPIO_137_ESC_RX1_CLK            0x0106120EU

#define GPIO_138_GPIO138                0x01061400U
#define GPIO_138_EPWM13B                0x01061401U
#define GPIO_138_EMIF2_D0               0x01061403U
#define GPIO_138_SCIB_RX                0x01061406U
#define GPIO_138_ESC_GPO5               0x0106140AU
#define GPIO_138_ESC_RX1_ERR            0x0106140EU

#define GPIO_139_GPIO139                0x01061600U
#define GPIO_139_EPWM14A                0x01061601U
#define GPIO_139_SCIC_RX                0x01061606U
#define GPIO_139_ESC_GPO6               0x0106160AU
#define GPIO_139_ESC_RX1_DATA0          0x0106160EU

#define GPIO_140_GPIO140                0x01061800U
#define GPIO_140_EPWM14B                0x01061801U
#define GPIO_140_SCIC_TX                0x01061806U
#define GPIO_140_ESC_GPO7               0x0106180AU
#define GPIO_140_ESC_RX1_DATA1          0x0106180EU

#define GPIO_141_GPIO141                0x01061A00U
#define GPIO_141_EPWM15A                0x01061A01U
#define GPIO_141_SCID_RX                0x01061A06U
#define GPIO_141_ESC_GPO8               0x01061A0AU
#define GPIO_141_ESC_RX1_DATA2          0x01061A0EU

#define GPIO_142_GPIO142                0x01061C00U
#define GPIO_142_EPWM15B                0x01061C01U
#define GPIO_142_SCID_TX                0x01061C06U
#define GPIO_142_ESC_GPO9               0x01061C0AU
#define GPIO_142_ESC_RX1_DATA3          0x01061C0EU

#define GPIO_143_GPIO143                0x01061E00U
#define GPIO_143_EPWM16A                0x01061E01U
#define GPIO_143_ESC_GPO10              0x01061E0AU
#define GPIO_143_ESC_LED_LINK0_ACTIVE   0x01061E0EU

#define GPIO_144_GPIO144                0x01080000U
#define GPIO_144_EPWM16B                0x01080001U
#define GPIO_144_ESC_GPO11              0x0108000AU
#define GPIO_144_ESC_LED_LINK1_ACTIVE   0x0108000EU

#define GPIO_145_GPIO145                0x01080200U
#define GPIO_145_EPWM1A                 0x01080201U
#define GPIO_145_ESC_GPO12              0x0108020AU
#define GPIO_145_ESC_LED_ERR            0x0108020EU

#define GPIO_146_GPIO146                0x01080400U
#define GPIO_146_EPWM1B                 0x01080401U
#define GPIO_146_ESC_GPO13              0x0108040AU
#define GPIO_146_ESC_LED_RUN            0x0108040EU

#define GPIO_147_GPIO147                0x01080600U
#define GPIO_147_EPWM2A                 0x01080601U
#define GPIO_147_ESC_GPO14              0x0108060AU
#define GPIO_147_ESC_LED_STATE_RUN      0x0108060EU

#define GPIO_148_GPIO148                0x01080800U
#define GPIO_148_EPWM2B                 0x01080801U
#define GPIO_148_ESC_GPO15              0x0108080AU
#define GPIO_148_ESC_PHY0_LINKSTATUS    0x0108080EU

#define GPIO_149_GPIO149                0x01080A00U
#define GPIO_149_EPWM3A                 0x01080A01U
#define GPIO_149_ESC_GPO16              0x01080A0AU
#define GPIO_149_ESC_PHY1_LINKSTATUS    0x01080A0EU

#define GPIO_150_GPIO150                0x01080C00U
#define GPIO_150_EPWM3B                 0x01080C01U
#define GPIO_150_ESC_GPO17              0x01080C0AU
#define GPIO_150_ESC_I2C_SDA            0x01080C0EU

#define GPIO_151_GPIO151                0x01080E00U
#define GPIO_151_EPWM4A                 0x01080E01U
#define GPIO_151_ESC_GPO18              0x01080E0AU
#define GPIO_151_ESC_I2C_SCL            0x01080E0EU

#define GPIO_152_GPIO152                0x01081000U
#define GPIO_152_EPWM4B                 0x01081001U
#define GPIO_152_ESC_GPO19              0x0108100AU
#define GPIO_152_ESC_MDIO_CLK           0x0108100EU

#define GPIO_153_GPIO153                0x01081200U
#define GPIO_153_EPWM5A                 0x01081201U
#define GPIO_153_ESC_GPO20              0x0108120AU
#define GPIO_153_ESC_MDIO_DATA          0x0108120EU

#define GPIO_154_GPIO154                0x01081400U
#define GPIO_154_EPWM5B                 0x01081401U
#define GPIO_154_ESC_GPO21              0x0108140AU
#define GPIO_154_ESC_PHY_CLK            0x0108140EU

#define GPIO_155_GPIO155                0x01081600U
#define GPIO_155_EPWM6A                 0x01081601U
#define GPIO_155_ESC_GPO22              0x0108160AU
#define GPIO_155_ESC_PHY_RESETN         0x0108160EU

#define GPIO_156_GPIO156                0x01081800U
#define GPIO_156_EPWM6B                 0x01081801U
#define GPIO_156_ESC_GPO23              0x0108180AU
#define GPIO_156_ESC_TX0_ENA            0x0108180EU

#define GPIO_157_GPIO157                0x01081A00U
#define GPIO_157_EPWM7A                 0x01081A01U
#define GPIO_157_ESC_GPO24              0x01081A0AU
#define GPIO_157_ESC_TX0_CLK            0x01081A0EU

#define GPIO_158_GPIO158                0x01081C00U
#define GPIO_158_EPWM7B                 0x01081C01U
#define GPIO_158_ESC_GPO25              0x01081C0AU
#define GPIO_158_ESC_TX0_DATA0          0x01081C0EU

#define GPIO_159_GPIO159                0x01081E00U
#define GPIO_159_EPWM8A                 0x01081E01U
#define GPIO_159_ESC_GPO26              0x01081E0AU
#define GPIO_159_ESC_TX0_DATA1          0x01081E0EU

#define GPIO_160_GPIO160                0x01460000U
#define GPIO_160_EPWM8B                 0x01460001U
#define GPIO_160_ESC_GPO27              0x0146000AU
#define GPIO_160_ESC_TX0_DATA2          0x0146000EU

#define GPIO_161_GPIO161                0x01460200U
#define GPIO_161_EPWM9A                 0x01460201U
#define GPIO_161_ESC_GPO28              0x0146020AU
#define GPIO_161_ESC_TX0_DATA3          0x0146020EU

#define GPIO_162_GPIO162                0x01460400U
#define GPIO_162_EPWM9B                 0x01460401U
#define GPIO_162_ESC_GPO29              0x0146040AU
#define GPIO_162_ESC_RX0_DV             0x0146040EU

#define GPIO_163_GPIO163                0x01460600U
#define GPIO_163_EPWM10A                0x01460601U
#define GPIO_163_ESC_GPO30              0x0146060AU
#define GPIO_163_ESC_RX0_CLK            0x0146060EU

#define GPIO_164_GPIO164                0x01460800U
#define GPIO_164_EPWM10B                0x01460801U
#define GPIO_164_ESC_GPO31              0x0146080AU
#define GPIO_164_ESC_RX0_ERR            0x0146080EU

#define GPIO_165_GPIO165                0x01460A00U
#define GPIO_165_EPWM11A                0x01460A01U
#define GPIO_165_MDXA                   0x01460A0AU
#define GPIO_165_ESC_RX0_DATA0          0x01460A0EU

#define GPIO_166_GPIO166                0x01460C00U
#define GPIO_166_EPWM11B                0x01460C01U
#define GPIO_166_MDRA                   0x01460C0AU
#define GPIO_166_ESC_RX0_DATA1          0x01460C0EU

#define GPIO_167_GPIO167                0x01460E00U
#define GPIO_167_EPWM12A                0x01460E01U
#define GPIO_167_MCLKXA                 0x01460E0AU
#define GPIO_167_ESC_RX0_DATA2          0x01460E0EU

#define GPIO_168_GPIO168                0x01461000U
#define GPIO_168_EPWM12B                0x01461001U
#define GPIO_168_MFSXA                  0x0146100AU
#define GPIO_168_ESC_RX0_DATA3          0x0146100EU

#endif // PIN_MAP_H
